app/controllers/home_controller.rb

SELECT `twitter_results`.id FROM `twitter_results` WHERE (`twitter_results`.`tweet` = BINARY 'RT @4H: Looking for something to do on a #snowday? Try one of these #blue-ribbon #4H #recipes! http:\\/\\/ow.ly\\/3OS5M' AND `twitter_results`.screen_name = 'Noble4H' AND `twitter_results`.tweet_created = '2009-05-19 18:24:46') LIMIT 1
---
  def store_data

    today_date = Date.today.to_s

    @file1 = File.open("public/stream_data.json","r")
#    @file1 = File.open("public/stream_data_#{today_date}.json","r")

    @file1.each do |line|
      if line
        line.match(/(.*?)"text":"(.*?)"(.*?)/)
        @tweet = $2

        if @tweet.to_s.language.to_s == "english"
          @twitter_result = TwitterResult.new
          line = line + " "

          line.match(/(.*?)"screen_name":"(.*?)"(.*?)/)
          @twitter_result.screen_name = $2
          line.match(/(.*?)"id_str":"(.*?)"(.*?)/)
          @twitter_result.tweet_id = $2

          @twitter_result.tweet = @tweet
          line.match(/(.*?)"source":"(.*?)"(.*?)/)
          @twitter_result.source = $2
          line.match(/(.*?)"location":"(.*?)"(.*?)/)
          @twitter_result.geo = $2

          @twitter_result.tweet_length = @twitter_result.tweet.length

INSERT INTO `twitter_results` (`tweet_id`, `tweet_length`, `has_link`, `created_at`, `has_question`, `updated_at`, `positive`, `negative`, `geo`, `tweet_created`, `tweet`, `source`, `spam`, `screen_name`) VALUES('41174475', 116, 1, '2011-02-03 07:58:31', 1, '2011-02-03 07:58:31', 0, 0, 'Noble County, Oklahoma', '2009-05-19 18:24:46', 'RT @4H: Looking for something to do on a #snowday? Try one of these #blue-ribbon #4H #recipes! http:\\/\\/ow.ly\\/3OS5M', '\\u003Ca href=\\', 0.0, 'Noble4H')
---
          @twitter_result.tweet_created = $2
          @twitter_result.has_question = @twitter_result.tweet.include? "?"

          @twitter_result.save